# TitleAutoPrefix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..TitleAutoPrefix Property
TaskDialog Class See Also
---
Whether the TaskDialog's title will automatically have the add-in name added as a prefix.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool TitleAutoPrefix { get; set; }
```

Visual Basic
---
```text
Public Property TitleAutoPrefix As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool TitleAutoPrefix {
	bool get ();
	void set (bool value);
}
```

# Remarks
The default value is true.
# See Also
TaskDialog Class
Autodesk.Revit.UI Namespace